# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Binaries
brew 'bash'
brew 'git'
brew 'node'
brew 'mas'

# Apps
cask 'java'
cask 'slack'
cask 'vlc'
cask 'sourcetree'
cask 'spotify'
cask 'notion'
cask 'caffeine'
cask 'appcleaner'
cask 'linear-linear'
cask 'figma'
cask 'microsoft-teams'
cask '1password'

# Dev apps
cask 'tableplus'
cask 'virtualbox'
cask 'cyberduck'
cask 'figma'
cask 'docker'

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge'

# Editors
cask 'visual-studio-code'

# Install Mac App Store apps
mas 'Spark', id: 1176895641
